---
kind: method
id: M:Autodesk.Revit.DB.FreeFormElement.CanOffsetFace(Autodesk.Revit.DB.Face)
source: html/c81b5066-cb87-192a-2095-9b96e08e9806.htm
---
# Autodesk.Revit.DB.FreeFormElement.CanOffsetFace Method

Determines if the input face of the FreeFormElement can be offset.

## Syntax (C#)
```csharp
public bool CanOffsetFace(
	Face face
)
```

## Parameters
- **face** (`Autodesk.Revit.DB.Face`) - The face to be checked.

## Returns
True if the face can be offset, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null